# GetOrigin Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..GetOrigin Method
StructuralConnectionHandler Class See Also
---
Retrieves origin point of Structural Connection Handler element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public XYZ GetOrigin()
```

Visual Basic
---
```text
Public Function GetOrigin As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetOrigin()
```

# ### Return Value
The origin point of element.
# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace